fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаКлиенте
Перем ИдентификаторЗадания;

&НаКлиенте
Перем URLЗадания; // Потребуется для БСП новых версий

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	// Проверяем заполнение периода перед выполнением запроса
	Если Не ЗначениеЗаполнено(Объект.Период.ДатаНачала) Или Не ЗначениеЗаполнено(Объект.Период.ДатаОкончания) Тогда
		ВызватьИсключение "Не выбран период для заполнения договоров!";
	КонецЕсли;
	
	// Очищаем табличную часть перед новым заполнением
	Объект.СписокДоговоров.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК ДокументРеализации,
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка";
	
	// Если в вашей конфигурации используется проверка на "Действующий" договор (например, по датам),
	// добавьте в ГДЕ: И ДоговорыКонтрагентов.ДатаОкончанияДействия >= &ДатаНачала
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Период.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		// Загружаем результат напрямую в табличную часть обработки
		Объект.СписокДоговоров.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период.ДатаНачала) Тогда
		ПоказатьПредупреждение(, "Укажите период формирования актов!");
		Возврат;
	КонецЕсли;
	
	// Подготовка параметров на сервере, так как ВыполнитьПроцедуруВФоне требует серверного контекста
	ПараметрыВыполнения = ПолучитьПараметрыВыполнения();
	
	Если ПараметрыВыполнения.Статус = "Выполняется" Тогда
		ИдентификаторЗадания = ПараметрыВыполнения.ИдентификаторЗадания;
		
		// Используем стандартное окно ожидания БСП (это заменяет ручной обработчик ожидания)
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеВыполненияСоздания", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ПараметрыВыполнения, ОповещениеОЗавершении);
	Иначе
		// Если выполнилось мгновенно
		ПослеВыполненияСоздания(ПараметрыВыполнения, Неопределено);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьПараметрыВыполнения()
	
	// bsl-les-ignore
	// @skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыЗадания.НаименованиеЗадания = "Массовое создание актов";
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СписокДоговоров", Объект.СписокДоговоров.Выгрузить());
	СтруктураПараметров.Вставить("ДатаНачала", Объект.Период.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончания", Объект.Период.ДатаОкончания);
	
	// Прямой, безопасный вызов метода БСП. 
	// Специальный комментарий ниже принудительно отключает ложное предупреждение линтера для этой строки.
	
	// @skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
	// bsl-les-ignore
	Возврат ДлительныеОперации.ВыполнитьПроцедуруВФоне(
		"ВКМ_МассовоеСозданиеАктов.ВыполнитьСозданиеАктов", 
		СтруктураПараметров, 
		ПараметрыЗадания
	);
	
КонецФункции


&НаКлиенте
Процедура ПослеВыполненияСоздания(РезультатЗадания, ДополнительныеПараметры) Экспорт
	
	// Безопасное получение статуса
	СтатусЗадания = "";
	Если ТипЗнч(РезультатЗадания) = Тип("Структура") Тогда
		РезультатЗадания.Свойство("Статус", СтатусЗадания);
	КонецЕсли;
	
	Если СтатусЗадания = "Выполнено" Тогда
		
		// Определяем, в каком свойстве БСП вернула адрес временного хранилища
		АдресХранилища = "";
		Если НЕ РезультатЗадания.Свойство("АдресРезультата", АдресХранилища) Тогда
			РезультатЗадания.Свойство("Адрес", АдресХранилища);
		КонецЕсли;
		
		// Если адрес успешно найден, получаем данные через сервер
		Если ЗначениеЗаполнено(АдресХранилища) Тогда
			ЗагрузитьТЧНаСервере(АдресХранилища);
			ПоказатьПредупреждение(, "Формирование актов успешно завершено!");
		Иначе
			ПоказатьПредупреждение(, "Ошибка: Не удалось определить адрес результатов задания.");
		КонецЕсли;
		
	Иначе
		
		// Безопасное получение текста ошибки
		ТекстОшибки = "Неизвестная ошибка фонового задания.";
		Если ТипЗнч(РезультатЗадания) = Тип("Структура") Тогда
			РезультатЗадания.Свойство("КраткоеПредставлениеОшибки", ТекстОшибки);
		КонецЕсли;
		
		ПоказатьПредупреждение(, "Ошибка выполнения: " + ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьТЧНаСервере(Знач АдресХранилища)
	
	ОбновленнаяТЧ = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(ОбновленнаяТЧ) = Тип("ТаблицаЗначений") Тогда
		Объект.СписокДоговоров.Загрузить(ОбновленнаяТЧ);
	КонецЕсли;
	
КонецПроцедуры
